HideActiveWorkPlane Method
Hide the active work plane of the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public void HideActiveWorkPlane()
Visual Basic
Public Sub HideActiveWorkPlane
Visual C++
public:
void HideActiveWorkPlane()
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsInvalidOperationException | Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →